<?php
// レーティング-クラス変換
$rating_class = array(
	0	=>	1221,	// クラスA（1221～1500）
	1	=>	500	// クラスB（ 500～1220）
);
// 期間限定ランキングの種別判定 (n=通常, t=チーム対抗, e=エリア踏破, f＝ピク杯、u=参加者企画)
$limited_type = array(
	151101	=>	'n',
	160306	=>	'n',
	160319	=>	'n',
	160423	=>	'n',
	160430	=>	'n',
	160806	=>	'n',
	170101	=>	't',
	170211	=>	't',
	170325	=>	't',
	170429	=>	't',
	171013	=>	't',
	171231	=>	'f',
	180101	=>	't',
	180429	=>	'f',
	180901	=>	'e',
	190209	=>	'u',
	190321	=>	'u',
	190802	=>	'e',
	200723	=>	'e',
	200918	=>	'e',
	210829	=>	'u',
	211022	=>	'e'
);
// 期間限定ランキング開催日一覧
$limited_stage_list = array(
	1	=>	151101,
	2	=>	160306,
	3	=>	160319,
	4	=>	160423,
	5	=>	160430,
	6	=>	160806,
	7	=>	170101,
	8	=>	170211,
	9	=>	170325,
	10	=>	170429,
	11	=>	171013,
	12	=>	180101,
	13	=>	180901,
	14	=>	190802,
	15	=>	200723,
	16	=>	200918,
	17	=>	211022
);
// 参加者企画の開催日一覧
$uplan_stage_list = array(
	1	=>	190209,
	2	=>	190321,
	3	=>	210829
);
// 終了した期間限定ランキングのナンバリング（開発中は無効にする）
$end_of_limited = 16;
if($mysql_mode === 0) $end_of_limited ++;

// 期間限定ランキングの対象ステージ一覧
$limited151101 = array(1001, 1002);
$limited160306 = array(1003, 1004);
$limited160319 = array(1005, 1006);
$limited160423 = array(1007, 1008);
$limited160430 = array(1009, 1010, 1011, 1012);
$limited160806 = array(1013, 1014);
$limited170101 = array(1015, 1016, 1017, 1018);
$limited170211 = array(1019, 1020, 1021, 1022);
$limited170325 = array(1023, 1024, 1025, 1026, 1027, 1028);
$limited170429 = array(1029, 1030, 1031, 1032, 1033, 1034, 1035);
$limited171013 = array(1036, 1037, 1038, 1039, 1040, 1041, 1042);
$limited180101 = array(1043, 1044, 1045, 1046, 1047, 1048, 1049, 1050);
$limited180901 = array(3001, 3002, 3003, 3004, 3006, 3007, 3008, 3010, 3011, 3012, 3013, 3014, 3015, 3016, 3017, 3019, 3020, 3021, 3022, 3023, 3024, 3025, 3026, 3028, 3029, 3030, 3032, 3033, 3034, 3035);
$arealim180901 = array(3005, 3009, 3018, 3027, 3031);
$limited190209 = array(4001, 4002, 4003, 4004, 4005, 4006, 4007, 4008, 4009, 4010, 4011, 4012, 4013, 4014, 4015, 4016, 4017, 4018, 4019, 4020, 4021, 4022, 4023, 4024, 4025, 4026, 4027, 4028, 4029, 4030);
$limited190321 = array(4031, 4032, 4033, 4034, 4035, 4036, 4037, 4038, 4039, 4040, 4041, 4042, 4043, 4044, 4045, 4046, 4047, 4048, 4049, 4050, 4051, 4052, 4053, 4054, 4055, 4056, 4057, 4058, 4059, 4060);
$limited190802 = array(3036, 3037, 3038, 3039, 3030, 3041, 3042, 3043, 3044, 3045, 3046, 3047, 3048, 3049, 3050, 3051, 3052, 3053, 3054, 3055, 3056, 3057, 3058, 3059, 3060, 3061, 3062, 3063, 3064, 3065);
$limited200723 = array(3066, 3067, 3068, 3069, 3070, 3071, 3072, 3073, 3074, 3075, 3076, 3077, 3078, 3079, 3080, 3081, 3082, 3083, 3084, 3085, 3086, 3087, 3088, 3089, 3090, 3091, 3092, 3093, 3094, 3095);
$limited200918 = array(3096, 3097, 3098, 3099, 3100, 3101, 3102, 3103, 3104, 3105, 3106, 3107, 3108, 3109, 3110, 3111, 3112);
$limited211022 = array(3113);

$arealim190802 = array();
$arealim200723 = array();
$arealim200918 = array();

$uplan190209 = range(4001, 4030);
$uplan190321 = range(4031, 4060);
$uplan210829 = range(4061, 4073);

// 最新の期間限定ランキング・参加者企画対象ステージリスト
$limited_stage = range(3113);

$limited_last = 1050;
$area_last = 3112;

// 代表選抜戦のステージ地位を定義
$rep_sel_mark = array(
	171013 =>	array(1041, 1040, 1039, 1038, 1042)
);
// 総合点に10倍して加算するステージ一覧
$limited_pik1 = array(1005, 1007, 1014, 1032, 1034, 1035);

// 期間限定ランキングの参加人数
$target_db = 'total_limited'.sprintf('%03d', $limited_num);
$rcount_query = "SELECT * FROM `user` WHERE $target_db != 0 ORDER BY $target_db DESC";
$rcount_result = mysqli_query($mysqlconn, $rcount_query);
$current_limited_player = mysqli_num_rows($rcount_result);

$uplan_player = array(
	1 => 4,
	2 => 3
);
$limited_player = array(
	1 => 0,
	2 => 6,
	3 => 7,
	4 => 3,
	5 => 8,
	6 => 6,
	7 => 9,
	8 => 12,
	9 => 13,
	10=> 14,
	11=> 13,
	12=> 14,
	13=> 16,
	14=> 16,
	15=> 25,
	16=> 26,
	17=> $current_limited_player
);
// 各ページのテーマカラー
$array_theme_color = array(
	0	=>	"",
	1	=>	"",
	2	=>	"",
	3	=>	"#bfbfbf", // 通常照合
	4	=>	"#f2f08a", // ピク1総合
	5	=>	"",
	6	=>	"",
	7	=>	"#ffc620", // 全総合
	8	=>	"#20fff6", // 特殊総合
	9	=>	"#ff20dd", // 通常照合
	10	=>	"#f2f085", // ピク1総合
	20	=>	"#f28aa2", // ピク2総合
	21	=>	"#f589ba", // タマゴあり
	22	=>	"#e88bc5", // タマゴなし
	23	=>	"#f5a190", // 本編地下
	30	=>	"#8bf28a", // ピク3総合 (119,43,95)
	31	=>	"#b7f07f", // お宝をあつめろ
	32	=>	"#91eb8d", // 原生生物をたおせ
	33	=>	"#90f5bf", // 巨大生物をたおせ
	36	=>	"#90eff5", // サイドストーリー
	40	=>	"#8ad2f2", // ピク4総合
	91	=>	"#a95cda", // 期間限定
	26	=>	"#da5cab", // 新チャレ（タマゴムシ縛り）
	28	=>	"#da5c7d", // 新チャレ（スプレー縛り）
	92	=>	"#81da5c", // 日替わり
	93	=>	"#dad35c", // 本編RTA
	94	=>	"#daa75c", // チャレ複合
	24	=>	"#da5c8e", // 2Pチャレ
	34	=>	"#5cda94", // 2Pミッション
	25	=>	"#d05cda", // 2Pバトル
	35	=>	"#b8da5c", // ビンゴ
	95	=>	"#b85cda", // バトル総合
	81	=>	"#9b5cda", // 無差別級
	82	=>	"#795cda", // TAS
	96	=>	"#da855c", // ソロバトル総合
	151101	=>	"#5c8bdb",
	160306	=>	"#625cdb",
	160319	=>	"#5ca3db",
	160423	=>	"#5c74db",
	160430	=>	"#5cc8db",
	160806	=>	"#5c9bdb",
	170101	=>	"#db5ca8",
	170211	=>	"#db5cd1",
	170325	=>	"#db5c7e",
	170429	=>	"#db5ccf",
	171013	=>	"#db5cb8",
	171231	=>	"#b6db5c", // 第1回ピク杯
	180101	=>	"#db5cd6",
	180901	=>	"#7de34d",
	190209	=>	"#a773df",
	190321	=>	"#a773df",
	190802	=>	"#9ed269",
	200723	=>	"#43c554",
	200918	=>	"#89cb52",
	210829	=>	"#a773df",
	211022	=>	"#89cb52"
);
// シーズンの定義 (2007年04月29日～2008年04月28日＝1期、以後原則一年周期)
$season = 0;
$season_border_fix = 0;
if(date('nd', $now_time) > 428) $season_border_fix = 1;
$season = date('Y', $now_time) + $season_border_fix - 2007;

$st01 = array('2007-04-29 00:00:00', '2008-04-28 23:59:59');
$st02 = array('2008-04-29 00:00:00', '2009-04-28 23:59:59');
$st03 = array('2009-04-29 00:00:00', '2010-04-28 23:59:59');
$st04 = array('2010-04-29 00:00:00', '2011-04-28 23:59:59');
$st05 = array('2011-04-29 00:00:00', '2012-04-28 23:59:59');
$st06 = array('2012-04-29 00:00:00', '2013-04-28 23:59:59');
$st07 = array('2013-04-29 00:00:00', '2014-04-28 23:59:59');
$st08 = array('2014-04-29 00:00:00', '2015-04-28 23:59:59');
$st09 = array('2015-04-29 00:00:00', '2016-04-28 23:59:59');
$st10 = array('2016-04-29 00:00:00', '2017-04-28 23:59:59');
$st11 = array('2017-04-29 00:00:00', '2018-04-28 23:59:59');
$st12 = array('2018-04-29 00:00:00', '2019-04-28 23:59:59');
$st13 = array('2019-04-29 00:00:00', '2020-04-28 23:59:59');
$st14 = array('2020-04-29 00:00:00', '2021-04-28 23:59:59');
$st15 = array('2021-04-29 00:00:00', '2022-04-28 23:59:59');
$st16 = array('2022-04-29 00:00:00', '2023-04-28 23:59:59');

$season_start = ${'st'.$season}[0];
$season_end   = ${'st'.$season}[1];

// POST内容の共通NGワード一覧
$ng_needle = array('?','.','\\','!','\$','/','<','>','\"','\'',' ','　','\n','\r','@');

// 期間限定ランキングの最終IDを定義（フィルタリング対策）
$limited_final_stage = max($limited_stage);

// リストアップ用に略称を定義
$limited_stage_title_fixed = array('個人戦','個人戦','個人戦','個人戦','個人戦','個人戦','チーム対抗戦','チーム対抗戦','チーム対抗戦','チーム対抗戦','チーム対抗戦','チーム対抗戦','エリア踏破戦','エリア踏破戦','エリア踏破戦','エリア踏破戦','エリア踏破戦');
$limited_stage_title_fixed = array_translate($limited_stage_title_fixed, "limited_stage_title_fixed");

// 参加者企画のイベント名を定義
$uplan_stage_title_fixed = array('一本勝負','一本勝負','ムシ取り大会');

// サブルール・優勝者・ベストステージの定義
$limited_stage_sub_fixed = array('スタンダード','スタンダード','スタンダード','スタンダード','スタンダード','スタンダード','スタンダード','スタンダード','短期決戦','ピンポイント','代表選抜制','ブラインド制','協力制','スタンダード','チーム対抗制','チーム対抗制','マイニング制');
$limited_stage_sub_fixed = array_translate($limited_stage_sub_fixed, "limited_stage_sub_fixed");

$limited_stage_win_fixed = array('参加者なし','ピクミンヤクザ (45,930 pts.)','バライト (68,580 pts.)','ピクミンヤクザ (15,075 pts.)','ピクミンヤクザ (80,223 pts.)','ピクミンヤクザ (17,765 pts.)',"チーム青ピクミン (98 - 97)","チーム白ピクミン (167 - 153)","チーム岩ピクミン (237 - 275)","チームヘビガラス (281 - 302)","偉そうで偉いチーム (231 - 242)","飴入道組 (314 - 327)","みんな (35 - 0)","iid01 (8 LPS)","チームツラノカワ🍊 (19 LPS)","チームオフランス🍐 (13 LPS)","？");
$limited_stage_mvp       = array('','','','','','','ピクミンヤクザ (33 RPS)','バライト (42 RPS)','flyinghawk (67 RPS)','ピクミンヤクザ (60 RPS)','じーた[次鋒] (56 RPS)','flyinghawk (76 RPS)','ごれい (16 LPS)','flyinghawk (80,910 pts.)','albut3 (680 RPS)','ごれい (422 RPS)','？');
$limited_stage_idea	 = array('','','','','','','','','','','','','','','コレクタールーム（250秒）[得票率23.4%：ピクミンヤクザ さん案]','神々のおもちゃ箱（線路は続くよどこまでも）[得票率22.3%：とりぽっぽ さん案]','？');

// チーム名の定義 (0は使わない)
$team = array('', 'チーム青ピクミン', 'チーム赤ピクミン','チーム白ピクミン','チーム紫ピクミン','チーム羽ピクミン','チーム岩ピクミン','チームデメマダラ','チームヘビガラス','偉そうで偉くないチーム','偉そうで偉いチーム','飴坊主組','飴入道組','チームヒダマリノミ🍓','チームツラノカワ🍊','チームオフランス🍐','チームカワスベール🍌','チームA','チームB');
$team = array_translate($team, "team");

$teamc= array('', '19acff', 'ff3919', 'eeeeee', 'b419ff','ff63f2','e3e3e3','f3524c','8ba9ff','e0e0e0','010101','45aee6','e6d745','e6456c','e6b945','45e675','dce645','aaaaaa','333333');

// チーム固有絵文字の定義
$teame = array();
$teame['a'] = array(15 => "🍓", 16 => "🍐");
$teame['b'] = array(15 => "🍊", 16 => "🍌");

// 開催回数からチーム番号を逆算する
$teamp = array();
$teamp['a'] = array(15 => 13, 16 => 15, 17 => 17);
$teamp['b'] = array(15 => 14, 16 => 16, 17 => 18);

// エリア踏破戦のマップの広さを定義
$ae_width = array(
	13 => 7,
	14 => 7,
	15 => 7,
	16 => 5,
	17 => 7
);
$ae_height = array(
	13 => 7,
	14 => 7,
	15 => 7,
	16 => 5,
	17 => 7
);
// エリア踏破戦のマップの面積（一番右下のマップ番号）を定義
$ae_area = array(
	12 => 0,
	13 => 49,
	14 => 98,
	15 => 147,
	16 => 172,
	17 => 221
);
// 参加者企画のメンバーを定義
$array_member = array();
/*
$target_db = 'total_uplan001';
$rcount_query = "SELECT * FROM `user` WHERE $target_db != 0 ORDER BY $target_db DESC";
$rcount_result = mysqli_query($mysqlconn, $rcount_query);
while ($row = mysqli_fetch_assoc($rcount_result) ) {
	$array_member[] = $row["user_name"];
}
*/
$array_member = array("§マリルイ", "albut3", "セレン", "すぱ～く");
$array_member2= array("§マリルイ", "albut3", "flyinghawk");

// 期間限定ランキングの開始時間と終了時間
$limited_time151101 = array('2015-11-01 15:00:00', '2015-11-08 14:59:59');
$limited_time160306 = array('2016-03-06 15:00:00', '2016-03-13 14:59:59');
$limited_time160319 = array('2016-03-19 15:00:00', '2016-03-26 14:59:59');
$limited_time160423 = array('2016-04-23 15:00:00', '2016-04-30 14:59:59');
$limited_time160430 = array('2016-04-30 15:00:00', '2016-05-07 14:59:59');
$limited_time160806 = array('2016-08-06 15:00:00', '2016-08-20 14:59:59');
$limited_time170101 = array('2017-01-01 15:00:00', '2017-01-08 14:59:59');
$limited_time170211 = array('2017-02-11 20:00:00', '2017-02-19 19:59:59');
$limited_time170325 = array('2017-04-02 20:00:00', '2017-04-02 21:59:59'); // 前半：3/25 20時～21時59分・後半：4/02 16時～17時59分
$limited_time170429 = array('2017-04-29 00:00:00', '2017-04-30 23:59:59');
$limited_time171013 = array('2017-10-13 22:00:00', '2017-10-15 21:59:59');
$limited_time180101 = array('2018-01-01 15:00:00', '2018-01-08 21:59:59');
$limited_time180901 = array('2018-09-01 01:00:00', '2018-09-03 00:59:59');
$limited_time190209 = array('2019-02-05 21:00:00', '2019-02-10 03:59:59'); // 参加者企画
$limited_time190321 = array('2019-03-21 20:00:00', '2019-03-22 00:59:59'); // 参加者企画
$limited_time190802 = array('2019-08-02 22:00:00', '2019-08-04 21:59:59');
$limited_time200723 = array('2020-07-23 22:00:00', '2020-07-26 21:59:59');
$limited_time200918 = array('2020-09-18 22:00:00', '2020-09-22 21:59:59');
$limited_time210829 = array('2021-08-29 21:00:00', '2021-08-29 23:59:59'); // 参加者企画
$limited_time211022 = array('2021-10-22 22:00:00', '2021-10-29 21:59:59');

// ステージ数の定義（2019年05月30日更新）
$stage_count_array = array(
	7 => 354,	// 全総合
	8 => 269,	// 特殊総合
	9 => 85,	// 通常総合
	10 => 5,	//*ピクミン総合
	20 => 30,	// ピクミン2総合
	21 => 13,	//*タマゴあり総合
	22 => 17,	//*タマゴなし総合
	23 => 14,	//+本編地下総合
	24 => 30,	//+2Pチャレンジ総合
	25 => 10,	//+2Pバトルモード総合
	26 => 13,	//+新チャレンジモード1総合
	27 => 30,	//?シーズン総合
	28 => 13,	//+新チャレンジモード2総合
	30 => 50,	// ピクミン3総合
	31 => 15,	//*お宝をあつめろ！
	32 => 15,	//*原生生物をたおせ！
	33 => 6,	//*巨大生物をたおせ！
	34 => 50,	//+2Pミッション総合
	35 => 12,	//+ビンゴバトルモード総合
	36 => 14,	//+サイドストーリーモード総合
	81 => 30,	//+無差別級総合
	82 => 30,	//+TAS総合
	91 => $end_of_limited - 1, //+期間限定総合
	92 => 30,	//+日替わり総合
	93 => 7,	//+本編RTA
	94 => 10,	//+チャレンジモード複合
	95 => 22,	// バトルモード総合
	96 => 22,	// ソロバトルモード総合
	98 => 0,	// 投稿数
	99 => 0		// タマゴムシくじ
);
